app/views/recipes/index.html.erb

            <td><%= recipe.name %></td>
            <td><%= recipe.ingredients.count %></td>
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]