app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.page(params[:page]).per(8)
---
SELECT  "recipes".* FROM "recipes" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)